const holyAngels = [
 {
    id: "michael",
    name: "St. Michael",
    amharicName: "ቅዱስ ሚካኤል",
    shortDescription:
      "Leader of the heavenly armies and protector of the faithful.",
    descriptionAm:
      "ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።",
    descriptionEn:
      "St. Michael is the leader of the heavenly armies...",
    image: "/holy/michael.jpg",
    video: "/holy/michaeel.mp4",
  },

  
  {
    id: "gebrel",
    name: "St. Gebrel",
    amharicName: "ቅዱስ ገብርኤል",
    shortDescription:
      "Leader of the heavenly armies and protector of the faithful.",
    descriptionAm:
      "ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።",
    descriptionEn:
      "St. Gebrel is the leader of the heavenly armies...",
       image: "/holy/gebrell.jpg",
    video: "/holy/michaeel.mp4",
  },
  {
    id: "rufael",
    name: "St. Rufael",
    amharicName: "ቅዱስ ",
    shortDescription:
      "Leader of the heavenly armies and protector of the faithful.",
    descriptionAm:
      "ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።",
    descriptionEn:
      "St. Rufael is the leader of the heavenly armies...",
      image: "/holy/michael.jpg",
    video: "/holy/michaeel.mp4",
  },



  {
    id: "raguel",
    name: "St. Raguel",
    amharicName: "ቅዱስ ራጉኤል",
    shortDescription:
      "Leader of the heavenly armies and protector of the faithful.",
    descriptionAm:
      "ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።",
    descriptionEn:
      "St. Rufael is the leader of the heavenly armies...",
      image: "/holy/raguel.jpg",
    video: "/holy/michaeel.mp4",
  },

  {
    id: "fanuel",
    name: "St. fanuel",
    amharicName: "ቅዱስ ",
    shortDescription:
      "Leader of the heavenly armies and protector of the faithful.",
    descriptionAm:
      "ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።",
    descriptionEn:
      "St. Rufael is the leader of the heavenly armies...",
      image: "/holy/fanuel.jpg",
    video: "/holy/michaeel.mp4",
  }
,
{
    id: "surafel",
    name: "St. Surafel",
    amharicName: "ቅዱስ ሰራፈል",
    shortDescription:
      "Leader of the heavenly armies and protector of the faithful.",
    descriptionAm:
      "ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።",
    descriptionEn:
      "St. Rufael is the leader of the heavenly armies...",
      image: "/holy/michael.jpg",
    video: "/holy/surafel.mp4",
  },
  {
    id: "urael",
    name: "St. urael",
    amharicName: "ቅዱስ ",
    shortDescription:
      "Leader of the heavenly armies and protector of the faithful.",
    descriptionAm:
      "ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።ቅዱስ  የሰማይ ሠራዊት አለቃ ነውየቅዱስ ሚካኤል ስዕል ታሪክ በኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስቲያን የረጅም ዘመን መሰረት ያለው ሲሆን፣ ሊቀ መላእክቱ በትግሉና በረዳትነቱ የሚታወቅበትን (እንደ እግዚአብሔር ያለ ማነው - መኑ ከመ አምላክ) ትርጉም ያንፀባርቃል። ስዕሉ በዋናነት የተመዘዘ ሰይፍ በእጁ የያዘ፣ ለምእመናን አጋዥና ተከላካይ፣ በተለይም በእግዚአብሔር ሠራዊት አለቅነት (ኢያሱ 5፡13-15) ታሪኩ ላይ የተመሰረተ ነው። የቅዱስ ሚካኤል ስዕል ታሪካዊና መንፈሳዊ ትርጉምዋና መለያዎች፦ ስዕሉ በተለምዶ በጦር ወይም በተመዘዘ ሰይፍ፣ እንዲሁም አጋንንትን ወይም ክፉን ነገር ሲረግጥ/ሲያሸንፍ ይታያል።መጽሐፍ ቅዱሳዊ መሰረት፦ በኢያሱ መጽሐፍ ላይ ኢያሪኮን ለማጥቃት ሲዘጋጅ 'የእግዚአብሔር ሠራዊት አለቃ' ሆኖ የመጣው መልአክ በስዕሉ ላይ ይገለጻል (ኢያሱ 5፡13)።ዓላማ፦ ቅዱስ ሚካኤል የጸሎት አቅራቢ፣ የነፍስ አዳኝና የሰው ልጆች ረዳት በመሆኑ፣ በቤተክርስቲያን ስዕሉ ለበረከት፣ ለምስጋናና ለተራዳኢነት ይጠቀሳል። ስዕሉ ቅዱስ ሚካኤል የእግዚአብሔርን ኃይልና ገናንነት እንደሚገልጥ ያሳያል።",
    descriptionEn:
      "St. Rufael is the leader of the heavenly armies...",
      image: "/holy/urael.jpg",
    video: "/holy/michaeel.mp4",
  }

  

  // You will add the remaining four later
];

export default holyAngels;
